/// папка - /const
///   файл film_class:
///     абстрактный класс Film
///     общий класс фильмов FilmPoster
///     enam языков
///     extension для выбора языка из enam  в строку
///
/// папка - /page
///   файл home_page:
///     стартовая страница, рисует из FilmColumn из /home/list_widget_film
///   файл page_information_film:
///     страница с подробной информацией
///       не доделана
///
/// папка - /widget/home -> виджеты для отбражения информации на стартовой странице
///   файл film_widget:
///     отрисовывает экземпляр класса фильмов на экране
///   файл filter_widget:
///     фильтрация списка фильмов
///       не доделано
///   файл list_widget_film:
///     содержит список экземпляров класса фильмов,
///     преобразует его в список виджетов для отрисовки на экране
